       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HELLO.
       AUTHOR.      SEKAR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'Hello World!'.
           STOP RUN.